# 3. Задайте два числа.Напишите программу, которая найдёт НОК(наименьшее общее кратное) этих двухчисел.

import sympy as sm
print(sm.lcm(int(input()), int(input())))
